Revit 2026 API

# FabricationService Class

---

This object contains information about a fabrication service.

SystemObject Autodesk.Revit.DBFabricationService

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationService : IDisposable
```
```vb
Public Class FabricationService
	Implements IDisposable
```
```cpp
public ref class FabricationService : IDisposable
```
```fsharp
type FabricationService =
    class
        interface IDisposable
    end
```

The FabricationService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Abbreviation | The short name of service. |
|  | FabricationSystemName | The fabrication system name of the service. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the service. |
|  | PaletteCount | The number of palettes in the service. |
|  | ServiceId | The service identifier of the service. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationService |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetButton | Gets the service button for a given palette index and button index from the service. |
|  | GetButtonCount | Gets the number of buttons for a given palette in the service. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPaletteName | Gets the name of a palette based on palette index. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCompatibleWith | Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification. |
|  | IsPaletteExcluded | Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions. |
|  | IsValidButtonIndex | Validates the button index. |
|  | IsValidPaletteIndex | Validates the palette index. |
|  | OverrideServiceButtonExclusion | Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only. |
|  | ResetServiceExclusionOverrides | Resets the overridden service palette and button exclusions back to default, as defined by the configuration. |
|  | SetServicePaletteExclusions |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A fabrication service defines what fabrication service buttons that can be used. Fabrication services are part of the fabrication configuration.

#### Reference

Autodesk.Revit.DB Namespace